#กรณี 1 print() มีข้อมูลหลายประเภท ใช้ 4 วิธี
#วิธีที่ 1 ใช้ , (โดยการแสดงผลที่ตรงจุด , จะเป็นการเว้น 1 spacce)
print('Hello',500,'weeb',789,True,'AHHHHHH',35+10,10.235)
#วิธีที่ 2 ใช้ + (ข้อมูลไหนที่ไม่ใช่ string ต้องทำให้เป็น string ใช้ฟังก์ชั่น str())
#ไม่มีเว้น space เหมือน , หรือวิธีที่ 1

print('Hello' + str(500) + 'weeb' + str(789) + str(True) + 'AHHHHHH' + str(35+10) + str(10.235))
print('Hello ' + " "+str(500) + ' weeb ' + str(789) +" " + str(True) + ' AHHHHHH ' + str(35+10)+" " + str(10.235))

# วิธีที่ 3 ใช้เบธอด format() โดยข้อมูลที่แสดงอยู่ในรูปของ string
# (ใช้ข้อมูลที่ไม่ใช่ string ให้ไส่ใน () ของ format และตำแหน่งที่ต้องการแสดงผลจะใช้ {} แทน)
print('Hello {} weeb {} {} AHHHHHH {} {}'.format(500,789,True,10+35,10.235))

# index number
print('{4} {2}' . format('a', 'b', 'c', 'd', 'e'))

#วิธีที่ 4 ใช้ f-string โดยข้อมูลที่แสดงอยู่ในรูปของ string โดยที่ f อยู่ข้างหน้า
#(ข้อมูลที่ไม่ใช่ string ให้เขียนใส่ใน {} ณ ตำแหน่งนั้นๆ)
print(f'Hello {500} weeb {789} {True} AHHHHHH {35+10} {10.235}')