# คำสั่งรับค่าข้อความ string ทางแป้นพิมพ์ ใช้ฟังก์ชัน input()
# **** ตัวแปร variable คือ ชื่อที่ Dev ตั้งขึ้นเอง (ต้องเป็นไปตามกฎการตั้งชื่อ) เอาไว้เก็บข้อมูลที่เกิดขึ้นในโปรแกรม
# ฟังก์ชั่นแปลงข้อวคามเป็นตัวเลข int() หรือ float()

fullname = input('ป้อนชื่อ: ')
year_born = int(input('ป้อนปีเกิด พ.ศ.: '))   # แปลงเป็น int ตั้งแต่รับค่า
print("-----------------------------")
# f-string
print(f'สวัสดีคุณ {fullname}')
print(f'คุณเกิดในปี พ.ศ. {year_born} ตอนนี้คุณอายุ {2568 - year_born} ปี')
print("-----------------------------")
# ใช้ ,
print("สวัสดีคุณ", fullname)
print("คุณเกิดในปี พ.ศ.", year_born, "ตอนนี้คุณอายุ", 2568 - year_born, "ปี")
print("-----------------------------")
# ใช้ +
print("สวัสดีคุณ " + fullname)
print("คุณเกิดในปี พ.ศ. " + str(year_born) + " ตอนนี้คุณอายุ " + str(2568 - year_born) + " ปี")
print("-----------------------------")
# ใช้ format()
print("สวัสดีคุณ {}".format(fullname))
print("คุณเกิดในปี พ.ศ. {} ตอนนี้คุณอายุ {} ปี".format(year_born, 2568 - year_born))
print("-----------------------------")