# สร้างโปรแกรมคำนวณผลคูณของตัวเลข 2 จำนวนที่รับทางแป้นพิมพ์ แล้วแสดงผลทางหน้าจอ 
# ทั้งนี้โปรแกรมจะทำการคำนวณผลคูณจากตัวเลขที่รับทางแป้นพิมพ์ไปเรื่อยๆ จนกว่าผลคูณจะมากกว่า 5000 ถึงจะหยุดการทำงาน
print("-----------------------------------------------")
print("-----------โปรแกรมคำนวณผลคูณของตัวเลข-----------")
print("-----------------------------------------------")
while True :
    num1 = int(input('ป้อนตัวเลขเพื่อคำนวณ: '))
    num2 = int(input('ป้อนตัวเลขที่2เพื่อคำนวณ: '))
    answer = num1*num2
    if answer > 5000 :
        print(f'ผลคูณที่ได้เท่ากับ {answer} มีค่า > 5000')
        break
    else :
        print(f"ผลคูณที่ได้เท่ากับ {answer}")
print("-----------------------------------------------")
print("-----------------จบการทำงาน--------------------")
print("-----------------------------------------------")