# โปรแกรมซึ่งรับชื่อ และอายุของผู้ใช้โปรแกรมทางแป้นพิมพ์ โดยหากอายุที่ผู้ใช้ป้อนมีค่าตั้งแต่ 35 ปีขึ้นไป ให้แสดงข้อความว่า  "คุณแก่แล้ว..." หากไม่ถึงให้แสดงข้อความ "คุณยังไม่แก่..." ทางหน้าจอ

from datetime import datetime

print('-----------------------------')
print(' โปรแกรมตรวจสอบวัยวุฒิ ')
print('-----------------------------')
your_name = input('ป้อนชื่อของคุณ : ')
your_yearborn = int(input('ป้อนปีเกิดของคุณ : '))
print('-----------------------------')

your_age = (datetime.now().year + 543) - your_yearborn

if your_age >= 35:
    print(f'คุณ {your_name} อายุ {your_age} แก่แล้วนะจ้ะ อย่าคิดมาก...')
else:
    print(f'คุณ {your_name} อายุ {your_age} ยังไม่แก่นะจ้ะ แจ่มเลย...')

print('-----------------------------')
