# ตรวจสอบค่าคาร์บอน ถ้ามีค่าเกิน 678.55 =ไม่ผ่าน น้อยกว่า 678.55 =ผ่าน รับinput ฃื่อ, ทะเบียนรถ, ปริมาณก๊าซที่วัดได้
 
print('--------------------------------')
print("""  ตรวจสอบสภาพรถ by สมหมายคาร์แคร์  """)
print('--------------------------------')
car_own = input('ป้อนชื่อเจ้าของรถ : ')
car_num = input("ป้อนหมายเลขทะเบียนรถ : ")
car_carb = float(input('ค่าปริมาณก๊าซคาร์บอนไดซ์ออกไซด์ : '))
print('--------------------------------')
if car_carb > 678.55 :
    print(f'รถหมายเลขทะเบียน {car_num} ของคุณ {car_own} ไม่ผ่านเกณฑ์')
else :
    print(f'รถหมายเลขทะเบียน {car_num} ของคุณ {car_own} ผ่านเกณฑ์')
 
print('--------------------------------')
print('ขอบคุณที่ใช้บริการ')
print('--------------------------------')