# โปรแกรมคำนวณค่าคอมมิชชั่นของพนักงานขาย โดยป้อนรหัสพนักงาน ชื่อพนักงาน และจำนวนเงินซึ่งเป็นยอดขายของพนักงาน จากผู้ใช้ทางแป้นพิมพ์ และคำนวณค่าคอมมิชชั่น จากเงื่อนไข ดังนี้
    # ขายของได้ไม่เกิน 1000 บาท ค่าคอมมิชชั่น เป็น 0.0 บาท
    # ขายของได้ตั้งแต่ 1001 – 2000  บาท ค่าคอมมิชชั่นคิด 	1% จากยอดขาย
    # ขายของได้ตั้งแต่ 2001 – 3000  บาท ค่าคอมมิชชั่นคิด 	3% จากยอดขาย
    # ขายของได้ตั้งแต่ 3001  บาท ขึ้นไป ค่าคอมมิชชั่นคิด 	5% จากยอดขาย

print ('--------------------------------')
print('โปรแกรมคํานวณค่าคอมมิชชั่นของพนักงานขาย')
print ('--------------------------------')
emp_id = input('ป้อนรหัสพนักงาน : ')
emp_name = input('ป้อนชื่อพนักงาน : ')  
emp_sale = input('ป้อนยอดขายของพนักงาน : ')
emp_sale = float(emp_sale)
if emp_sale <= 1000:
    commission = 0.0
elif emp_sale > 1000 and emp_sale <= 2000:
    commission = emp_sale * 0.01
elif emp_sale > 2000 and emp_sale <= 3000:
    commission = emp_sale * 0.03
else:
    commission = emp_sale * 0.05
print(f'รหัสพนักงาน {emp_id} ชื่อ {emp_name} ยอดขาย {emp_sale} ค่าคอมมิชชั่น {commission}')
print ('--------------------------------')