# โปรแกรมตรวจสอบข้อมูลสายรถเมล์ โดยที่
	# หากผู้ใช้ป้อนสายรถเมล์ 3 แสดงข้อความ สาย  3 ไปสนามหลวง ลาดพร้าว
	# หากผู้ใช้ป้อนสายรถเมล์ 71 แสดงข้อความ สาย  71ไปหัวลำโพง เยาวราช
	# หากผู้ใช้ป้อนสายรถเมล์ 56 แสดงข้อความ สาย 56 ไปบางลำพู สะพานกรุงธน
	# หากผูใช้ป้อนสายรถเมล์ 539 แสดงข้อความ สาย  539 ไปอนุสวรีย์ชัย สามเสน
	# หากผู้ใช้ป้อนสายรถเมล์สายอื่นนอกจากนี้ แสดงข้อความ ยังไม่มีข้อมูลสายรถเมล์ที่สอบถาม

print ('--------------------------------')
print('     ตรวจสอบสายรถเมล์       ')
print ('--------------------------------')
car_number = input('ป้อนทะเบียนรถ')
print ('--------------------------------')
if car_number == '57' :
    print(f'สาย {car_number} ไปปิ่นเกล้า บางขุนนนท์')
elif car_number == '3' :
    print(f'สาย {car_number} ไปสนามหลวง ลาดพร้าว')
elif car_number == '71' :
    print(f'สาย {car_number} ไปหัวลำโพง เยาวราช')
elif car_number == '539' :
    print(f'สาย {car_number} ไปอนุสวรีย์ชัย สามเสน')
else :
    print(f'ยังไม่มีข้อมูลสายรถเมล์ที่สอบถาม')
print ('--------------------------------')