# โปรแกรมทายตัวเลข โดยมีการทำงานของโปรแกรมดังนี้
# - ให้ผู้ใช้ทายตัวเลขโดยการป้อนตัวเลขทางแป้นพิมพ์
# - โดยกรณีที่ตัวเลขที่ป้อนมีค่าเท่ากับ 59 ให้แสดงข้อความ “ยินดีด้วยคุณทายถูก”
# - แต่หากตัวเลขที่ป้อนมีค่ามากหรือน้อยกว่า 59 ให้แสดงข้อความ “คุณทายผิดตัวเลขที่ป้อนมากไป” 
# หรือ “คุณทายผิดตัวเลขที่ป้อนน้อยไป” และให้ผู้ใช้ป้อนใหม่  โดยโปรแกรมจะวนให้ผู้ใช้ป้อนไปเรื่อยๆ จนกว่าจะทายถูก


print("-----------------------------------------------")
print("--------------โปรแกรมทายตัวเลข------------------")
print("-----------------------------------------------")


while True :
    random_int = int(input(f"   มาทายตัวเลขกันโบร๋ ลองป้อนตัวเลขมาได้เลย: "))
    if random_int == 59 :
        print(f"             “ยินดีด้วยคุณทายถูก”")
        break
    elif random_int > 59 :
        print("“คุณทายผิด....ตัวเลขที่ป้อนมากไป”")
    else :
        print("“คุณทายผิด....ตัวเลขที่ป้อนน้อยไป”")    
print("-----------------------------------------------")
print("-----------------เก่งดีนิๆ------------------------")
print("-----------------------------------------------")